#include <vector>
#include <string>
#include <sstream>
#include <stdexcept>
#include <iostream>
#include <fstream>
#include <cstdio>
#include <cstdarg>
#include <cstdlib>
#include <cmath> // for cos and sin

#include <glob.h>
#include <sys/types.h>
#include <sys/stat.h>
#include <unistd.h>

#include <rclcpp/rclcpp.hpp>
#include "serial/serial.h"

//sudo apt-get install ros-humble-vision-msgs
#include "std_msgs/msg/u_int8.hpp"
#include "std_msgs/msg/bool.hpp"
#include "sensor_msgs/msg/laser_scan.hpp"

#include <tf2_geometry_msgs/tf2_geometry_msgs.hpp>
#include <tf2_ros/transform_broadcaster.h>
#include "geometry_msgs/msg/pose_stamped.hpp"
#include "robot_custom_msgs/msg/camera_data.hpp"
#include "robot_custom_msgs/msg/camera_data_array.hpp"
//#include "robot_custom_msgs/msg/line_laser_data.hpp"
//#include "robot_custom_msgs/msg/line_laser_data_array.hpp"
#include <builtin_interfaces/msg/time.hpp>
#include "nav_msgs/msg/odometry.hpp"
#include "std_msgs/msg/string.hpp"

#define USE_DEBUG_LOG false

#define USE_LINELASER_SENSOR 0

enum class CommandNumber : uint8_t {
    ProtocolV0 = 0x10,               // Protocol V0
    ProtocolV1_Objects = 0x11,       // Protocol V1 (Objects)
    ProtocolV1_2LL = 0x12,           // Protocol V1 (2LL)
    ProtocolV2_Objects = 0x13,       // Protocol V2 (Objects)
    ProtocolV2_2LL = 0x14,              // Protocol V2 (2LL)
    
    Error = 0x20,                       // Error

    OTA_Start = 0x30,                   // OTA Start

    VersionRequest = 0x50,              // Version Sequest (Request)
    CalibrationRequest = 0x51,          // Clibration Start Request (Request)
    SensorControlRequest = 0x52,        // Sensor Control Request (Request)

    VersionResponse = 0x60,             // Version Response ( Response )
    CalibrationResponse  = 0x61,        // Clibration Start Response  (Response )
    SensorControlResponse = 0x62,       // Sensor Control Response (Request)
};

struct LagacyPacketData
{
    uint8_t pre_amble_0;       
    uint8_t pre_amble_1;       
    uint8_t data_size;         
    uint8_t header;            
    uint8_t number_of_objects;
    uint8_t distance;          // 거리
    uint8_t x_0;               // X 좌표
    uint8_t x_1;               // X 좌표
    uint8_t y_0;               // Y 좌표
    uint8_t y_1;               // Y 좌표
    uint8_t width_0;           // 폭
    uint8_t width_1;           // 폭
    uint8_t height_0;          // 높이
    uint8_t height_1;          // 높이 
    uint8_t checksum;          
};

struct ObjectData
{
    uint8_t class_id;
    int16_t x;
    int16_t y;
    int16_t theta;         // 각도 (Theta)
    int16_t width;         // 너비 (Width)
    int16_t height;        // 높이 (Height)
    uint16_t distance;     // 거리 (Distance)
};

struct ObjectDataV2
{
    uint8_t class_id;      // 객체의 클래스 ID
    uint8_t confidence;    // 신뢰도 (0~100)
    int16_t x;             // X 좌표
    int16_t y;             // Y 좌표
    int16_t theta;         // 각도 (Theta)
    int16_t width;         // 너비 (Width)
    int16_t height;        // 높이 (Height)
    uint16_t distance;     // 거리 (Distance)
};

struct ObjectPacketData
{
    uint8_t pre_amble_0;
    uint8_t pre_amble_1;
    uint8_t data_size;
    uint8_t header;
    uint8_t number_of_objects;
    std::vector<ObjectData> objects;
    uint8_t checksum;
};

struct ObjectV2PacketData
{
    uint8_t pre_amble_0;             // 0xAA
    uint8_t pre_amble_1;             // 0x55
    uint8_t data_size;               // Variable: Number of following data bytes
    uint8_t header;                  // 0x13 (Command header)
    uint8_t version_1;               // New: First Version field
    uint8_t version_2;               // New: Second Version field
    uint8_t number_of_objects;       // Variable: Number of objects
    std::vector<ObjectDataV2> objects; // Variable-length list of objects
    uint8_t checksum;                // Checksum for the packet
};

#if USE_LINELASER_SENSOR > 0
struct LLData
{
    int16_t x;
    int16_t y;
    int16_t theta;
    int16_t width;
    int16_t height;
    uint16_t distance;
};

struct LLDataV2
{
    int16_t x;
    int16_t y;
    int16_t theta;
    // int16_t width;
    int8_t direction; // Added field for Direction
    int8_t reserved;  // Added field for Reserved
    int16_t height;
    uint16_t distance;
};

struct LLPacketData
{
    uint8_t pre_amble_0;
    uint8_t pre_amble_1;
    uint8_t data_size;
    uint8_t header;
    uint8_t number_of_2LL;
    std::vector<LLData> LL;
    uint8_t checksum;
};

struct LLV2PacketData
{
    uint8_t pre_amble_0;
    uint8_t pre_amble_1;
    uint8_t data_size;
    uint8_t header;
    uint8_t version_1; // New: First Version field
    uint8_t version_2; // New: Second Version field
    uint8_t number_of_2LL;
    std::vector<LLDataV2> LL;
    uint8_t checksum;
};
#endif

struct ErrorSection {
    uint8_t occurred;        // Error 발생 여부 (1: 발생, 0: Clear)
    uint8_t rank;            // 특정 Error 로 고정
    uint8_t errorCode[3];    // 3바이트 문자열
};

// Define the main data packet struct
struct ErrorDataPacket{
    uint8_t PRE_AMBLE_0;    // 0xAA
    uint8_t PRE_AMBLE_1;    // 0x55
    uint8_t Data_Size;      // Total size of the packet
    uint8_t Header_Command; // 0x20
    uint8_t Number_of_Objects; // Variable number of objects (ErrorSection count)

    std::vector<ErrorSection> Errors; // Vector to store error sections

    uint8_t CHECKSUM;       // ADD(4~끝-1)
};

struct VersionResponsePacket {
    uint8_t PRE_AMBLE_0;  // 0xAA
    uint8_t PRE_AMBLE_1;  // 0x55
    uint8_t Data_Size;    // 4
    uint8_t Header_Command; // 0x60
    uint8_t Version1;     // Version part 1
    uint8_t Version2;     // Version part 2
    uint8_t CHECKSUM;     // ADD(4~6)
};

struct CalibrationResultPacket
{
    uint8_t PRE_AMBLE_0;
    uint8_t PRE_AMBLE_1;
    uint8_t Data_Size;
    uint8_t Header_Command;
    uint8_t Result;
    uint8_t CHECKSUM;
};

struct SensorControPacket
{
    uint8_t PRE_AMBLE_0;
    uint8_t PRE_AMBLE_1;
    uint8_t Data_Size;
    uint8_t Header_Command;
    uint8_t Result;
    uint8_t CHECKSUM;
};


double current_pose_x = 0.0;
double current_pose_y = 0.0;
double current_pose_theta = 0.0;

double amcl_pose_x = 0.0;
double amcl_pose_y = 0.0;
double amcl_pose_angle = 0.0;

std::string aiVersion = "0.0";

class AIInterface : public rclcpp::Node
{
public:
    AIInterface() : Node("airbot_ai_interface")
    {
        // 파라미터 설정 (USB 포트 및 보레이트)
        this->declare_parameter("port","/dev/ttyAI");
        this->declare_parameter("baudrate",921600);
